
Archived entries from file /afs/csail.mit.edu/u/j/johnmwu/core/mind/sys/short/proc/main.org


* DONE Decide on what to do for PWCCA
     CLOSED: [2019-08-05 Mon 17:11]
     CLOCK: [2019-08-05 Mon 14:22]--[2019-08-05 Mon 14:22] =>  0:00
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-05 Mon 19:03
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis/Top k correlations in SVCCA?
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
One observation is that taking the sum or the mean makes no difference.

Ahh, ok. I think I can save
- alignments (raw)
- alignments * corrs
** DONE Edit ju notebook to do these extra computations
   CLOSED: [2019-08-05 Mon 16:46]
   CLOCK: [2019-08-05 Mon 14:22]--[2019-08-05 Mon 16:46] =>  2:24
** DONE Copy paste the notebook in
   CLOSED: [2019-08-05 Mon 17:09]
   CLOCK: [2019-08-05 Mon 16:46]--[2019-08-05 Mon 17:09] =>  0:23
** DONE Edit how writing works
   CLOSED: [2019-08-05 Mon 17:11]
   CLOCK: [2019-08-05 Mon 17:09]--[2019-08-05 Mon 17:11] =>  0:02

** DONE Can I get a scrolling, interactive heatmap?
      CLOSED: [2019-08-05 Mon 19:03]
      CLOCK: [2019-08-05 Mon 17:51]--[2019-08-05 Mon 19:03] =>  1:12
OK, so it is possible. I should look into a few things:
- [X] ipywidgets
  - [X] What is a "widget"?
  - [X] Try getting a heatmap to display

* TODO Change the casing on if network == other_network
     CLOCK: [2019-08-06 Tue 12:03]--[2019-08-06 Tue 12:45] =>  0:42
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-06 Tue 12:43
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis/Top k correlations in SVCCA?
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: TODO
  :END:
NVM, just leave it as a continue. I think the issue is because the
singular values are not different from one another.
* DONE For linreg, create a similarity dict. Forgot to do this. 
  CLOSED: [2019-08-06 Tue 19:30]
  CLOCK: [2019-08-06 Tue 19:25]--[2019-08-06 Tue 19:30] =>  0:05
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-06 Tue 19:40
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis/Create correlations measures out of corrs and linreg.
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
  

* DONE corr
     CLOSED: [2019-08-06 Tue 19:17]
     CLOCK: [2019-08-06 Tue 14:42]--[2019-08-06 Tue 19:17] =>  4:35
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-06 Tue 19:40
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis/Create correlations measures out of corrs and linreg.
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
Hmm... =neuron_notated_sort= doesn't seem to be the correct data
structure.

What should it be?

{network: [(neuron, {other: val})]} just like linreg.

Thus, we need to get rid of self.clusters

- [X] Change write_correlations
- [X] Add similarity functionality

* DONE linreg
     CLOSED: [2019-08-06 Tue 14:38]
     CLOCK: [2019-08-06 Tue 13:47]--[2019-08-06 Tue 14:38] =>  0:51
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-06 Tue 19:40
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis/Create correlations measures out of corrs and linreg.
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
So actually, the information is all computed already, I would just need
to write it to a file.

I need to change =write_correlations=.

- [X] Make it save the neuron_sort, neuron_notated_sort, and the
  pred_power
  - [X] Edit compute correlations hnb
  - [X] Copy stuff over to .py file
  - [X] Edit writing; I think it should use =torch.save= now..
  - [X] Copy stuff over to .py file

* DONE Create correlations measures out of corrs and linreg. 
  CLOSED: [2019-08-06 Tue 19:41]
  CLOCK: [2019-08-06 Tue 13:45]--[2019-08-06 Tue 13:47] =>  0:02
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-06 Tue 19:41
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
 
 You could aggregate values in various ways -- mean, max. 
 
 There are more ways to use cca. For example, take the average of the
 top k cc values.

 Note: don't skip the pair between a layer and itself, because these
 won't be 1.

* DONE Change everything to use pickling
    CLOSED: [2019-08-07 Wed 11:49]
    CLOCK: [2019-08-07 Wed 11:39]--[2019-08-07 Wed 11:49] =>  0:10
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-07 Wed 11:49
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
Will need to make everything become NumPy I think.

Wait. When should I make it numpy? Perhaps just at the end.. actually,
it's not super important...

- [X] maxmin
- [X] linreg
- [X] cca
- [X] lincka
- [X] rbfcka

* TODO Have a look at results from hassan and nadir
  CLOCK: [2019-08-07 Wed 11:54]--[2019-08-07 Wed 12:34] =>  0:40
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-07 Wed 13:49
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: TODO
  :END:

* TODO Why did minlinreg fail?
     CLOCK: [2019-08-08 Thu 18:49]--[2019-08-09 Fri 12:04] => 17:15
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-08 Thu 18:56
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis/Top k correlations in SVCCA?
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: TODO
  :END:
Wait, I don't think it did.      

* DONE Rewrite maxmin and meanstd computations
     CLOSED: [2019-08-09 Fri 19:05]
     CLOCK: [2019-08-09 Fri 18:40]--[2019-08-09 Fri 19:05] =>  0:25
     CLOCK: [2019-08-08 Thu 17:24]--[2019-08-08 Thu 18:49] =>  1:25
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-09 Fri 19:06
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis/Visualizations: cmaps, more sentences, more neurons
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
I feel like many of these computations can be rewritten so they read
from files on disk, and operate on files on disk. I feel like this is
particularly true of simple statistics like mean, std, etc.

So, what should the format of such a file be?

{
    "mean": {model : means},
    "std" : {model : std},
    "max" : {model : max},
    "min" : {model : min},
}

Ahh, shit.

Waiting on jobid 7691. Great. Works?

Great. Waiting on jobid 7694. 

* DONE Convert all computers to ubuntu 18
   CLOSED: [2019-08-09 Fri 19:50]
   CLOCK: [2019-08-09 Fri 19:06]--[2019-08-09 Fri 19:50] =>  0:44
   CLOCK: [2019-08-09 Fri 18:03]--[2019-08-09 Fri 18:04] =>  0:01
   CLOCK: [2019-08-09 Fri 18:03]--[2019-08-09 Fri 18:03] =>  0:00
   CLOCK: [2019-08-09 Fri 18:03]--[2019-08-09 Fri 18:03] =>  0:00
   CLOCK: [2019-08-09 Fri 17:51]--[2019-08-09 Fri 18:03] =>  0:12
   CLOCK: [2019-08-09 Fri 15:34]--[2019-08-09 Fri 15:54] =>  0:20
   CLOCK: [2019-08-09 Fri 14:53]--[2019-08-09 Fri 15:16] =>  0:23
   CLOCK: [2019-08-09 Fri 12:04]--[2019-08-09 Fri 12:44] =>  0:40
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-09 Fri 19:50
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
Waiting on Jim to see if I can be added to =sls-sudoers=.

Waiting on installers on quad, beorn, and sugar to finish.

- [X] begin installer on chris's computer
Wait for that to finish
- [X] Login on all machines, make sure that /data/sls is accessible. 

* DONE [#A] Top k correlations in SVCCA?
    CLOSED: [2019-08-12 Mon 13:42]
    CLOCK: [2019-08-05 Mon 14:05]--[2019-08-05 Mon 14:22] =>  0:17
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-12 Mon 13:42
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:

I don't think it's useful to put code for it in =corr_methods.py=. I
should just load the canonical correlations, and do everything directly.

There is also an interesting idea: could I get the heatmap to change, as
you change the value of k?

Well, for PWCCA, this is not as straightforward. It would require more
computation. Also, how would you even do it?
** DONE Fix pwcca stuff
     CLOSED: [2019-08-08 Thu 12:24]
     CLOCK: [2019-08-08 Thu 12:24]--[2019-08-08 Thu 12:24] =>  0:00
- [X] Create a test script     
- [X] Run the test script
- [X] Get results
- [X] Rerun
- [X] Get results
** DONE Regen nb for analysis-8
     CLOSED: [2019-08-09 Fri 18:39]
     CLOCK: [2019-08-09 Fri 18:04]--[2019-08-09 Fri 18:29] =>  0:25
     CLOCK: [2019-08-09 Fri 17:22]--[2019-08-09 Fri 17:51] =>  0:29
     CLOCK: [2019-08-09 Fri 15:56]--[2019-08-09 Fri 16:02] =>  0:06
     CLOCK: [2019-08-09 Fri 12:44]--[2019-08-09 Fri 14:53] =>  2:09
     CLOCK: [2019-08-08 Thu 12:24]--[2019-08-08 Thu 12:49] =>  0:25
Actually, I should regen analysis-8 entirely.
- [X] Run all methods again
- [X] Get results
  
Ahh, shit. minlinreg failed. Actually, I don't think it failed.

waiting on jobid 5275, which is maxlinreg. OK, everything looks good.
- [X] Regen
  - [X] Make test sbatchable
  - [X] Wait on results
    
    Wait, so is the sbatch finished? Yep
  - [X] Regen first for the test
    
    We need to get the analysis nb working again. 
    - [X] Create a generic =update= function that works for both pw and
      sv.
    - [X] Create interactive heatmaps for maxmincorr and linregcorr
      - [X] Reindex to make rows = columns
  - [X] Copy test over, regen
    
    Waiting on notebook analysis-8 to finish

* DONE CCA
      CLOSED: [2019-08-13 Tue 13:59]
      CLOCK: [2019-08-13 Tue 12:41]--[2019-08-13 Tue 13:59] =>  1:18
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-13 Tue 13:59
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis/Add the more models suggested by yonatan./Look at errors. Some errors may be due to memory; should try and fix these.
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
Shit... this may actually be coded wrong. Ahhhhhhh shit.

Okay, well would it be good now? What is taking up memory? Yeah, should
be good now. If I give 240GB, it should be all g. 


* DONE [#A] Evidence that RBFCKA is stable under different sizes of the dataset
    CLOSED: [2019-08-14 Wed 11:25]
    CLOCK: [2019-08-09 Fri 16:02]--[2019-08-09 Fri 17:20] =>  1:18
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-14 Wed 11:25
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
- [X] How exactly would I get such evidence?
  
  My code currently supports taking the first k words of the corpus. I
  could run this with different values of k. However, the initial values
  would then be overloaded. I don't think this is a huge deal,
  though. Alternatively, I could take samples of size 10000. 
  
  I think what I'll do is just 5000, 10000, 15000, 20000. I don't think
  the evidence needs to be super statistically motivated; as long as we
  say we didn't see much of a difference, I think it's ok.
- [X] Setup everything for running =mk_results12.sh=. 
  - [X] Create the script, and dependencies
    - [X] Create mk_results12-helper.sh
    - [X] 
  - [X] Alter readme
- [X] Run mk_results12.sh
- [X] Get results
  
  Waiting on jobs 1098{4..7}
- [X] Why did it fail? Wait, what? time limit exceeded? Fuck...
- [X] How many iterations did it get through?
- [X] Shit.. Actually though, why is it even using dask? 
  - [X] Before that, change the limit to affect the original tensors
    being loaded in, NOT just during RBFCKA. 
    - [X] Remove the limit stuff from RBFCKA
    - [X] Add limit stuff in loading
      - [X] I should raise an error in the loading if the results are
        not all the same shape. Actually, nvm. That can be implemented
        as a separate function, =check_correct= or something. 
      - [X] sldkfj
    - [X] 
  - [X] I'll test again, we'll see
    
    11620       gpu mk_resul  johnmwu  R       0:30      1 sls-sm-6
    11621       gpu mk_resul  johnmwu  R       0:30      1 sls-sm-3
    11622       gpu mk_resul  johnmwu  R       0:30      1 sls-sm-3
    11623       gpu mk_resul  johnmwu  R       0:30      1 sls-titan-10
  - [X] Try again with some print statements. This is really weird that
    only 20000 doesn't work.
    
    Hmm... idk.. it seems to have taken 5h.
** DONE Create results12 with different filenames. fuck!
     CLOSED: [2019-08-14 Wed 10:56]
     CLOCK: [2019-08-14 Wed 10:54]--[2019-08-14 Wed 10:56] =>  0:02
Waiting on jobs 3049{2,3,4}     
** DONE Create an analysis notebook for RBFCKA. 
   CLOSED: [2019-08-14 Wed 11:25]
   CLOCK: [2019-08-14 Wed 10:56]--[2019-08-14 Wed 11:25] =>  0:29

* DONE [#A] Correlations of random activations
    CLOSED: [2019-08-14 Wed 13:42]
    CLOCK: [2019-08-14 Wed 13:23]--[2019-08-14 Wed 13:42] =>  0:19
    CLOCK: [2019-08-13 Tue 18:35]--[2019-08-13 Tue 18:43] =>  0:08
    CLOCK: [2019-08-13 Tue 14:05]--[2019-08-13 Tue 14:21] =>  0:16
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-14 Wed 13:42
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:

- [X] Create script     
  - [X] Create helper
    - [X] Create opt13 and repr_files13
  - [X] 
- [X] Edit readme
- [X] Get results
  
  Submitted batch job 30751
  Submitted batch job 30752
  Submitted batch job 30753
  Submitted batch job 30754
  Submitted batch job 30755
  Submitted batch job 30756
OK, I can now copy over the analysis nb. Ahh, shit! I fucked it up.

I need to somehow make =representations_d= able to use indices that are
other than just the basename of the dirname. The simplest solution is
just to change fname2mname.

Fuck. I'd thought that the structure would be more something like
=/elmo_rand/ptb_pos_dev.hdf5=
=/elmo/ptb_pos_dev.hdf5=
than what it currently is.

Okee, let's continue
- [X] Get results
  
  Submitted batch job 32135
  Submitted batch job 32136
  Submitted batch job 32137
  Submitted batch job 32138
  Submitted batch job 32139
  Submitted batch job 32140
- [X] Create analysis13 nb?


* DONE For RBFCKA, compute some statistics
  CLOSED: [2019-08-14 Wed 14:07]
  CLOCK: [2019-08-14 Wed 13:48]--[2019-08-14 Wed 14:07] =>  0:19
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-14 Wed 14:07
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:

  

* DONE Commit and push the images? That would help others that aren't here. 
  CLOSED: [2019-08-14 Wed 14:38]
  CLOCK: [2019-08-14 Wed 14:07]--[2019-08-14 Wed 14:38] =>  0:31
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-14 Wed 14:38
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:

* WAIT [#A] Regen CCA for everything that needs it.
    CLOCK: [2019-08-14 Wed 16:27]--[2019-08-14 Wed 16:29] =>  0:02
    CLOCK: [2019-08-14 Wed 16:26]--[2019-08-14 Wed 16:27] =>  0:01
    CLOCK: [2019-08-14 Wed 13:11]--[2019-08-14 Wed 13:23] =>  0:12
    CLOCK: [2019-08-13 Tue 14:00]--[2019-08-13 Tue 14:05] =>  0:05
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-14 Wed 16:29
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: WAIT
  :END:
Subsumed into another task

Waiting on 30749 and 30750

I guess this would be results 1 and 8

Oh... fuck me. Somehow, things are tensors again in CCA. I can't have
this. FUCK. Need to change CCA to save things as numpy arrays. Then run
again for 1 and 8.

Converting from torch tensor to np array: what ways are there to do
this? How about np.asarray or something? Maybe that's safer? Ahh,
whatever. We're sure we're using torch anyway.

Submitted batch job 46440
Submitted batch job 46441

Then we need to regen analysis-8. 

* DONE Regen analysis 8 after all new runs are complete
    CLOSED: [2019-08-15 Thu 11:56]
    CLOCK: [2019-08-14 Wed 16:27]--[2019-08-14 Wed 16:27] =>  0:00
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-15 Thu 11:56
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
Submitted batch job 46444
Submitted batch job 46445
Submitted batch job 46446
Submitted batch job 46447
Submitted batch job 46448
Submitted batch job 46449

Redo mincorr
Submitted batch job 46545


* DONE [#A] Writeup of what we've been doing, send to Jim
    CLOSED: [2019-08-16 Fri 16:01]
    CLOCK: [2019-08-16 Fri 15:25]--[2019-08-16 Fri 16:01] =>  0:36
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-08-16 Fri 16:01
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
I guess I'll just do this in plain text?

I can include it as an update?

* DONE attn analysis
  CLOSED: [2019-09-24 Tue 11:38]
  CLOCK: [2019-09-24 Tue 11:11]--[2019-09-24 Tue 11:36] =>  0:25
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-09-24 Tue 11:39
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:

* WAIT [#A] Add the more models suggested by yonatan.
  CLOCK: [2019-08-07 Wed 16:02]--[2019-08-07 Wed 16:35] =>  0:33
  CLOCK: [2019-08-07 Wed 13:50]--[2019-08-07 Wed 14:14] =>  0:24
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-09-24 Tue 11:39
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: WAIT
  :END:
** DONE Get tester scripts to run successfully
     CLOSED: [2019-08-07 Wed 18:10]
     CLOCK: [2019-08-07 Wed 17:19]--[2019-08-07 Wed 18:10] =>  0:51
     CLOCK: [2019-08-07 Wed 17:15]--[2019-08-07 Wed 17:18] =>  0:03
- [X] Run      
- [X] Can I load these files into Jupyter?
- [X] Try recreating analysis-8 as a test analysis nb
  - [X] Where should I put this analysis nb?
  - [X] 
** DONE Create new script
   CLOSED: [2019-08-07 Wed 18:54]
   CLOCK: [2019-08-07 Wed 18:10]--[2019-08-07 Wed 18:54] =>  0:44
* TODO Document, readme, finish up analyis
    CLOCK: [2019-08-16 Fri 11:05]--[2019-08-16 Fri 11:40] =>  0:35
    CLOCK: [2019-08-15 Thu 12:14]--[2019-08-15 Thu 14:19] =>  2:05
    CLOCK: [2019-08-14 Wed 18:56]--[2019-08-14 Wed 18:56] =>  0:00
    CLOCK: [2019-08-14 Wed 16:56]--[2019-08-14 Wed 17:46] =>  0:50
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-09-24 Tue 11:39
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: TODO
  :END:
- [X] Create a module =var.py= which houses functions which will need to
  be reimplemented by each user. 
- [X] Change first_half_only_l etc to be False by default, and allow
  these values in the function.
  - [X] Change hnb
  - [X] 
- [X] Is there a way to import the =var.py= file from my ju notebooks?
  
  Maybe I can have my environment automatically have the project as part
  of its path?
- [X] Define a network_sort_key function
- [X] regen analysis-13
- [X] I should write small docstrings for each Method
  object. Unfortunately, I'm not sure whether to put this under the
  Method object, or the __init__ function.
Okay, I'm pretty much done =corr_methods=.

- [X] Copy improvements in analysis-8 over to the test analysis nb. 
- [X] Answer Yonatan's requests
  - [X] sldkjf
- [ ] 

* TODO Dynamic loading of tensors
    CLOCK: [2019-08-13 Tue 17:24]--[2019-08-13 Tue 17:48] =>  0:24
    CLOCK: [2019-08-13 Tue 16:36]--[2019-08-13 Tue 16:38] =>  0:02
     CLOCK: [2019-08-07 Wed 14:14]--[2019-08-07 Wed 16:02] =>  1:48
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-09-24 Tue 11:40
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: TODO
  :END:
This is annoying because it isn't testable through Jupyter. Wait. IS
it? Also, this might be method-specific.

Wait. I think my computer should support cuda9.. let's try installing pt
with cuda9 and seeing what happens.

It seems we need an older version of PyTorch. Ahh... didn't work.

Hmmm... maybe we try to do it on the GPU, and if it fails, then we
switch that iteration to the cpu. I think this is probably the cleanest.
* Visualizations: cmaps, more sentences, more neurons
    CLOCK: [2019-08-08 Thu 14:41]--[2019-08-08 Thu 17:24] =>  2:43
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-09-24 Tue 11:41
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan/contextual-corr-analysis
  :ARCHIVE_CATEGORY: main
  :END:
- [X] Regen everything in results-1    
  - [X] Rewrite =mk_results1.sh=. I guess it should be an sbatch script
    instead?
  - [X] Run it
  - [X] Get results
  - [X] 
- [X] Rewrite vis notebook to reflect new data format

* contextual-corr-analysis
  CLOCK: [2019-08-05 Mon 11:13]--[2019-08-05 Mon 14:05] =>  2:52
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-09-24 Tue 11:41
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan
  :ARCHIVE_CATEGORY: main
  :END:

* DONE Look at Yonatan's implementations of the attention corrs
  CLOSED: [2019-09-24 Tue 11:52]
  CLOCK: [2019-09-20 Fri 19:23]--[2019-09-20 Fri 19:36] =>  0:13
  CLOCK: [2019-09-19 Thu 16:23]--[2019-09-19 Thu 17:52] =>  1:29
  CLOCK: [2019-09-13 Fri 20:51]--[2019-09-13 Fri 21:29] =>  0:38
  CLOCK: [2019-09-13 Fri 19:53]--[2019-09-13 Fri 19:58] =>  0:05
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-09-24 Tue 11:52
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
** TODO What attention corr methods has yonatan implemented?
    CLOCK: [2019-09-19 Thu 17:52]--[2019-09-19 Thu 18:04] =>  0:12
OK, so =attentions_l= is a list of num_heads x n_word x n_word tensors.

Wait, the mean frobenius norm isn't fair. Longer sentences will have a
smaller frobenius norm difference. Maybe I can propose a better
approach. 

The key question is: given two sequences of matrices, how what is the
"similarity" between those two sequences?

How would we evaluate a measure of attention similarity? Actually, we
can use the same thing CKA did---how well the similarity index can
predict. If M1, M2 are two of the same model trained from different
initializations, the first transformer head layer in M1 should be most
similar to the first transformer head layer in M2. 

Another thing we could think about is what the transformation measure
should be invariant under, and what it shouldn't.

Unfortunately, we don't have a big representation matrix to think
about. We can't take something like that and look at its eigvals or
something.
* DONE Organize task list for project
   CLOSED: [2019-09-24 Tue 11:56]
   CLOCK: [2019-09-24 Tue 11:42]--[2019-09-24 Tue 11:56] =>  0:14
  :PROPERTIES:
  :ARCHIVE_TIME: 2019-09-24 Tue 11:56
  :ARCHIVE_FILE: ~/core/mind/sys/short/proc/main.org
  :ARCHIVE_OLPATH: yonatan
  :ARCHIVE_CATEGORY: main
  :ARCHIVE_TODO: DONE
  :END:
What separations do I want to make?
- tasks vs things to learn

  within this, tasks yonatan specifically mentions vs tasks I want to
  do.
- 

